Repository: gabrieltron/coup-d-bot
Catalog: locales/*/LC_MESSAGES/*.po
Languages: pt

source: Captain
pt: Capitão

source: Duke
pt: Duque

source: Embassador
pt: Embaixador

source: Assassin
pt: Assassino

source: Duchess
pt: Duquesa

source: There's already a game in this chat, finish it firt. Alternatively, you can /force_game, but it'll interrupt the current game!
pt: Já existe um jogo nesse chat, termine-o primeiro. Ou, você pode /force_game, mas isso interromperá o jogo atual!

source: The game must be started in a group.
pt: O jogo deve ser iniciado em um grupo

source: A game was started.
pt: Um jogo foi iniciado

source: The game was not start. Start it using /start
pt: O jogo não foi iniciado. Comece-o usando /start

source: You're already in a game.
pt: Você já está em um jogo.

source: You can't enter a match that has already started. Wait for it to end or start a new one.
pt: Você não pode entrar em uma partida que já começou. Espere ele terminar ou comece um novo.

source: To join a game send this command to a group where the game has been started.
pt: Para se juntar a um jogo mande esse comando para um grupo onde o jogo foi iniciado.

source: You're already in a game. Quit or finish it first.
pt: Você já está em um jogo. Feche ou termine-o primeiro.

source: You joined a game.
pt: Você juntou-se a um jogo.

source: Start game
pt: Começar jogo

source: Quit game
pt: Sair do jogo

source: You can't do this. Try sending me a hi in private first :)
pt: Você não pode fazer isso. Tente me mandar um oi no privado antes :)

source: *Influences and it's actions*
pt: *Influencias e suas ações*

source: *All* - Get 1 coin. Get 2 coins. Spend 7 coins to give a coup d'etat (kill a influence of a player of your choice). With 10 or more coins, coup d'etat is mandatory.
pt: *Todos* - Pegue 1 moeda. Pegue 2 moedas. Gaste 7 moedas para dar um golpe de estado (mate uma influência de um jogador da sua escolha). Com 10 ou mais moedas golpe de estado é obrigatório

source: *Duke* - Get 3 coins. Blocks a player of getting 2 coins.
pt: *Duque* - Pegue 3 moedas. Bloqueia um jogador de pegar 2 moedas,

source: *Captain* - Steals 2 coins of another player. Blocks other captains.
pt: *Capitão* - Rouba 2 moedas de outro jogador. Bloqueia outros capitães.

source: *Embassador* - Asks for foreign aid, buy the number of influeces you possess, eliminates them until you have the number of you had before. Blocks captains.
pt: *Embaixador* - Pede ajuda externa, compra o número de influências que possui, depois ilimina influências até ter o número de influências que tinha antes. Bloqueia capitães.

source: *Assassin* - Kills a influence of a player of your choice for 3 coins.
pt: *Assassino* - Mata uma influência de um jogador a sua escolha por 3 moedas.

source: *Duchess* - Blocks assassins.
pt: *Duquesa* - Bloqueia o assassino.

source: Foreign aid
pt: Ajuda externa

source: Show
pt: Mostrar

source: Remove
pt: Remover

source: Hide
pt: Esconder

source: A card from {} was deleted.
pt: Uma carta de {} foi deletada.

source: {} bought a new card
pt: {} comprou uma nova carta

source: {} finished a foreign aid
pt: {} terminou uma ajuda extrangeira

source: You won the game
pt: Você ganhou o jogo.

source: Game over, {} won
pt: Fim de jogo, {} ganhou.

source: {} used foreign aid.
pt: {} usou ajuda externa.

source: You quitted the game.
pt: Você saiu do jogo.

source: This action can only be done in a group with a started game.
pt: Essa ação só pode ser feita em grupos que iniciaram o jogo.

source: This group haven't started a game.
pt: Esse grupo ainda não iniciou o jogo.

source: Game over.
pt: Fim de jogo.

source: You're not in a game.
pt: Você não está em um jogo.

source: *{}*: {} card(s).
pt: *{}*: {} carta(s).

source: {} foreign aid card(s)
pt: {} carta(s) de ajuda externa.

source: */start* - Start a game in a group.
pt: */start* - Começa o jogo em um grupo.

source: */join* - User joins the game if that match hasn't started.
pt: */join* - Usuário junta-se ao jogo se a partida ainda não começou.

source: */force_endgame* - Forces the end of the game in a group.
pt: */force_endgame* - Força o fim do jogo em um grupo.

source: */rules* - Send a message with the game's rules.
pt: */rules* - Manda uma mensagem com as regras do jogo.

source: */status* - Send to the group the current state of the game.
pt: */status* - Manda para o grupo o estado atual do jogo.

source: Each player is a member of the french court and possess two influences. Each player playes once per round, on it's turn the player performs an action, which actions each influence can perform will be explained at the beginning of the game. When an action from a specific influence is performed, the player must declare "I'm X and I'll do Y", other players com accept or contest, claiming the player doesn't have it influence it claims to have. If the player was really bluffing, it hides it's influences and let the contestant player choose a card to delete, otherwise the player shows that it really had that influence and it's the contestant player that hide it's cards and allow a card to be deleted.
pt: Cada jogador é um membro da corte francesa e possui duas influências. Cada jogador joga uma vez por rodada, em seu turno o jogador realiza uma ação, as ações que cada influência pode fazer são explicadas no início do jogo. Quando uma ação específica de uma influência é feita, o jogador deve declarar "Sou X e farei Y", outros jogadores podem aceitar ou conestar, alegando que o jogador não possui a influência que declara ter. Se o jogador estava realmente blefando, ele esconde suas cartas e o jogador que o contestou escolhe uma para remover, do contrário o jogador que contestou erroneamente esconde suas cartas e tem uma delas removidas pelo jogador da vez.

source: When a player is a victm of the assassin or a coup d'etat, it must hide it's cards and allow the attacker to choose one to remove.
pt: Quando um jogador é vítima de assassinato ou de um golpe de estado, ele deve esconder suas cartas e permitir que o atacante escolha uma para remover.

source: In order to keep the social aspect of the game, this bot doesn't implement coins. This is no obstacle, literally anything can represent coins, from cutted paper to the christmas socks your aunt Barbara gave to you and you never unpacked.
pt: Para manter o aspecto social do jogo, esse bot não implementa moedas. Isso não é um obstaculo, literalmente qualquer coisa pode representar moedas, de papéis cortados até meias de natal que sua tia Barbara te deu e você nunca abriu.

source: Wins the game the last player with at least one influence remaining.
pt: Ganha o jogo o último jogador com pelo menos uma influência restante.
